<template>
    <header>
        <div class="top"></div>
        <nav class="nav">
            <NuxtLink to="/favorite" class="nav__item" active-class="nav__item--active">
                <div>
                    <svg width="18" height="16" viewBox="0 0 18 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M2.33423 2.15646C1.76936 2.66876 1.37143 3.48526 1.37143 4.72395C1.37143 5.49178 1.74054 6.37595 2.39401 7.31711C3.0395 8.24677 3.91325 9.16191 4.80764 9.97678C5.69901 10.7889 6.59325 11.4856 7.26619 11.98C7.5571 12.1937 7.80563 12.3689 7.99334 12.4985C8.18198 12.3641 8.43262 12.1821 8.72639 11.9604C9.40033 11.4517 10.296 10.7378 11.1889 9.9135C12.0848 9.08641 12.9605 8.16421 13.6075 7.24032C14.2647 6.30178 14.6286 5.44202 14.6286 4.72398C14.6286 2.85557 13.1163 1.35487 11.2692 1.35487C10.1581 1.35487 9.17135 1.89912 8.55652 2.74372C8.42767 2.92072 8.22047 3.02564 7.99979 3.02563C7.77911 3.02562 7.57192 2.92069 7.44309 2.74369C6.82837 1.89912 5.84181 1.35487 4.73039 1.35487C3.73916 1.35487 2.90933 1.63487 2.33423 2.15646ZM7.99982 13.3229C7.62433 13.8897 7.6242 13.8897 7.62404 13.8896L7.62215 13.8883L7.61733 13.8852L7.5999 13.8738C7.58488 13.864 7.56313 13.8497 7.5351 13.831C7.47905 13.7938 7.39785 13.7394 7.29508 13.669C7.08961 13.5284 6.79758 13.3242 6.44779 13.0672C5.74933 12.554 4.81505 11.8266 3.87789 10.9728C2.94375 10.1217 1.98898 9.12898 1.26308 8.0835C0.545151 7.04952 0 5.89125 0 4.72395C0 3.1806 0.507664 1.97383 1.40677 1.15839C2.29563 0.352238 3.48815 0 4.73039 0C6.00311 0 7.15307 0.503906 7.99985 1.31539C8.84671 0.503913 9.99675 0 11.2692 0C13.8899 0 16 2.12338 16 4.72398C16 5.85265 15.4496 6.99111 14.7353 8.01113C14.0108 9.04579 13.0579 10.0425 12.1252 10.9034C11.1895 11.7672 10.2565 12.5105 9.55901 13.037C9.20971 13.3007 8.91813 13.5109 8.71307 13.6559C8.61051 13.7284 8.5295 13.7845 8.47364 13.823C8.4457 13.8422 8.42405 13.8569 8.40912 13.8671L8.39183 13.8788L8.38707 13.882L8.38568 13.8829C8.38552 13.883 8.38495 13.8834 7.99982 13.3229ZM7.99982 13.3229L8.38568 13.8829C8.15667 14.0365 7.85564 14.0393 7.62404 13.8896L7.99982 13.3229Z"
                            fill="#2D3B87" />
                    </svg>
                </div>
                <span>Избранное</span>
            </NuxtLink>
            <NuxtLink to="/" class="nav__item" active-class="nav__item--active">
                <div>
                    <svg width="20" height="18" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M13.9998 7.57598L6 3" stroke="#2D3B87" stroke-width="1.1" stroke-linecap="round"
                            stroke-linejoin="round" />
                        <path
                            d="M18 13.4426V6.33151C17.9997 6.01975 17.9174 5.71356 17.7614 5.44365C17.6054 5.17375 17.3811 4.94961 17.1111 4.79373L10.8889 1.23818C10.6186 1.08214 10.3121 1 10 1C9.68793 1 9.38137 1.08214 9.11111 1.23818L2.88889 4.79373C2.6189 4.94961 2.39465 5.17375 2.23863 5.44365C2.08262 5.71356 2.00032 6.01975 2 6.33151V13.4426C2.00032 13.7544 2.08262 14.0606 2.23863 14.3305C2.39465 14.6004 2.6189 14.8245 2.88889 14.9804L9.11111 18.536C9.38137 18.692 9.68793 18.7741 10 18.7741C10.3121 18.7741 10.6186 18.692 10.8889 18.536L17.1111 14.9804C17.3811 14.8245 17.6054 14.6004 17.7614 14.3305C17.9174 14.0606 17.9997 13.7544 18 13.4426Z"
                            stroke="#2D3B87" stroke-width="1.2" stroke-linecap="round" stroke-linejoin="round" />
                        <path d="M2.5 5.5L10.0002 9.89611L17.5 5.5" stroke="#2D3B87" stroke-width="1.2"
                            stroke-linecap="round" stroke-linejoin="round" />
                        <path d="M9.99951 18L9.99951 9.88867" stroke="#2D3B87" stroke-width="1.2" stroke-linecap="round"
                            stroke-linejoin="round" />
                    </svg>
                </div>
                <span>Склад</span>
            </NuxtLink>
            <NuxtLink to="/deals" class="nav__item" active-class="nav__item--active">
                <div>
                    <svg width="18" height="18" viewBox="0 0 18 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M4.00012 1.66675L1.50012 5.00008V16.6667C1.50012 17.1088 1.67572 17.5327 1.98828 17.8453C2.30084 18.1578 2.72476 18.3334 3.16679 18.3334H14.8335C15.2755 18.3334 15.6994 18.1578 16.012 17.8453C16.3245 17.5327 16.5001 17.1088 16.5001 16.6667V5.00008L14.0001 1.66675H4.00012Z"
                            stroke="#2D3B87" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
                        <path d="M1.50012 5H16.5001" stroke="#2D3B87" stroke-width="1.5" stroke-linecap="round"
                            stroke-linejoin="round" />
                        <path
                            d="M12.3334 8.3335C12.3334 9.21755 11.9822 10.0654 11.3571 10.6905C10.732 11.3156 9.88414 11.6668 9.00008 11.6668C8.11603 11.6668 7.26818 11.3156 6.64306 10.6905C6.01794 10.0654 5.66675 9.21755 5.66675 8.3335"
                            stroke="#2D3B87" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
                    </svg>
                </div>
                <span>Сделки</span>
            </NuxtLink>
        </nav>
    </header>
</template>

<style lang="scss" scoped>
* {
    font-size: 13px;
}
header{
    display: flex;
    flex-direction: column;
    justify-content: space-between;
    height: 110px;
    margin-bottom: 10vh;
}
.top {
    height: 40px;
    border-bottom-right-radius: 10px;
    border-bottom-left-radius: 10px;
    background: rgba(224, 227, 238, 1);
}

.nav {
    display: flex;
    justify-content: end;
    width: 100%;
    
    &__item {
        display: flex;
        flex-direction: column;
        justify-content: center;
        align-items: center;
        gap: 4px;
        padding: 6px 0 7px 0;
        height: 50px;
        width: 86px;
        font-weight: 600;
        color: rgba(45, 59, 135, 1);
        cursor: pointer;
        &--active{
            background: rgba(244, 245, 249, 1);
            border-radius: 10px;
        }
    }
}
</style>
